Revit 2027 API
PathReinforcement.GetHostId Method
 The element that contains the Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetHostId()
Public Function GetHostId As ElementId
public:
ElementId^ GetHostId()
member GetHostId : unit -> ElementId
Return Value
ElementId
 The element that the Path Reinforcement object belongs to, such as a structural wall, floor or foundation.
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace